---
kind: type
id: T:Autodesk.Revit.DB.ExternalFileReference
source: html/22f83514-5da8-bbf1-33e5-94e6212b53fe.htm
---
# Autodesk.Revit.DB.ExternalFileReference

A class that contains the details of a reference to a file outside of a given document.

## Syntax (C#)
```csharp
public class ExternalFileReference : IDisposable
```